
## Plan Result (stg)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.storage_contributors[&#34;0a542636-7796-4d43-89f7-f6fc9a8eb495&#34;]
* Update
  * module.juror-er-redis.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.storage_contributors["0a542636-7796-4d43-89f7-f6fc9a8eb495"] will be created
  + resource "azurerm_role_assignment" "storage_contributors" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0a542636-7796-4d43-89f7-f6fc9a8eb495"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.Storage/storageAccounts/jurorsastg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.juror-er-redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-er-portal-redis-cache-cache-stg/providers/Microsoft.Cache/redis/juror-er-portal-redis-cache-stg"
        name                               = "juror-er-portal-redis-cache-stg"
        tags                               = {
            "application"         = "juror"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/juror-er-portal.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#juror-dev"
            "environment"         = "staging"
            "managedBy"           = "Juror"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (14 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":118,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->